dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxEvadc_bf.h
/** \brief Mask for Ifx_EVADC_G_BOUND_Bits.BOUNDARY1 */
#define IFX_EVADC_G_BOUND_BOUNDARY1_MSK (0xfffu)

/** \brief Offset for Ifx_EVADC_G_BOUND_Bits.BOUNDARY1 */
#define IFX_EVADC_G_BOUND_BOUNDARY1_OFF (16u)

/** \brief Length for Ifx_EVADC_G_SYNCTR_Bits.STSEL */
#define IFX_EVADC_G_SYNCTR_STSEL_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_SYNCTR_Bits.STSEL */
#define IFX_EVADC_G_SYNCTR_STSEL_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_SYNCTR_Bits.STSEL */
#define IFX_EVADC_G_SYNCTR_STSEL_OFF (0u)

/** \brief Length for Ifx_EVADC_G_SYNCTR_Bits.EVALR1 */
#define IFX_EVADC_G_SYNCTR_EVALR1_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SYNCTR_Bits.EVALR1 */
#define IFX_EVADC_G_SYNCTR_EVALR1_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SYNCTR_Bits.EVALR1 */
#define IFX_EVADC_G_SYNCTR_EVALR1_OFF (4u)

/** \brief Length for Ifx_EVADC_G_SYNCTR_Bits.EVALR2 */
#define IFX_EVADC_G_SYNCTR_EVALR2_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SYNCTR_Bits.EVALR2 */
#define IFX_EVADC_G_SYNCTR_EVALR2_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SYNCTR_Bits.EVALR2 */
#define IFX_EVADC_G_SYNCTR_EVALR2_OFF (5u)

/** \brief Length for Ifx_EVADC_G_SYNCTR_Bits.EVALR3 */
#define IFX_EVADC_G_SYNCTR_EVALR3_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SYNCTR_Bits.EVALR3 */
#define IFX_EVADC_G_SYNCTR_EVALR3_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SYNCTR_Bits.EVALR3 */
#define IFX_EVADC_G_SYNCTR_EVALR3_OFF (6u)

/** \brief Length for Ifx_EVADC_G_Q_QCTRL_Bits.SRCRESREG */
#define IFX_EVADC_G_Q_QCTRL_SRCRESREG_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_Q_QCTRL_Bits.SRCRESREG */
#define IFX_EVADC_G_Q_QCTRL_SRCRESREG_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_Q_QCTRL_Bits.SRCRESREG */
#define IFX_EVADC_G_Q_QCTRL_SRCRESREG_OFF (0u)

/** \brief Length for Ifx_EVADC_G_Q_QCTRL_Bits.TRSEL */
#define IFX_EVADC_G_Q_QCTRL_TRSEL_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_Q_QCTRL_Bits.TRSEL */
#define IFX_EVADC_G_Q_QCTRL_TRSEL_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_Q_QCTRL_Bits.TRSEL */
#define IFX_EVADC_G_Q_QCTRL_TRSEL_OFF (6u)

/** \brief Length for Ifx_EVADC_G_Q_QCTRL_Bits.XTSEL */
#define IFX_EVADC_G_Q_QCTRL_XTSEL_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_Q_QCTRL_Bits.XTSEL */
#define IFX_EVADC_G_Q_QCTRL_XTSEL_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_Q_QCTRL_Bits.XTSEL */
#define IFX_EVADC_G_Q_QCTRL_XTSEL_OFF (8u)

/** \brief Length for Ifx_EVADC_G_Q_QCTRL_Bits.XTLVL */
#define IFX_EVADC_G_Q_QCTRL_XTLVL_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QCTRL_Bits.XTLVL */
#define IFX_EVADC_G_Q_QCTRL_XTLVL_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QCTRL_Bits.XTLVL */
#define IFX_EVADC_G_Q_QCTRL_XTLVL_OFF (12u)

/** \brief Length for Ifx_EVADC_G_Q_QCTRL_Bits.XTMODE */
#define IFX_EVADC_G_Q_QCTRL_XTMODE_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_Q_QCTRL_Bits.XTMODE */
#define IFX_EVADC_G_Q_QCTRL_XTMODE_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_Q_QCTRL_Bits.XTMODE */
#define IFX_EVADC_G_Q_QCTRL_XTMODE_OFF (13u)

/** \brief Length for Ifx_EVADC_G_Q_QCTRL_Bits.XTWC */
#define IFX_EVADC_G_Q_QCTRL_XTWC_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QCTRL_Bits.XTWC */
#define IFX_EVADC_G_Q_QCTRL_XTWC_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QCTRL_Bits.XTWC */
#define IFX_EVADC_G_Q_QCTRL_XTWC_OFF (15u)

/** \brief Length for Ifx_EVADC_G_Q_QCTRL_Bits.GTSEL */
#define IFX_EVADC_G_Q_QCTRL_GTSEL_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_Q_QCTRL_Bits.GTSEL */
#define IFX_EVADC_G_Q_QCTRL_GTSEL_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_Q_QCTRL_Bits.GTSEL */
#define IFX_EVADC_G_Q_QCTRL_GTSEL_OFF (16u)

/** \brief Length for Ifx_EVADC_G_Q_QCTRL_Bits.GTLVL */
#define IFX_EVADC_G_Q_QCTRL_GTLVL_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QCTRL_Bits.GTLVL */
#define IFX_EVADC_G_Q_QCTRL_GTLVL_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QCTRL_Bits.GTLVL */
#define IFX_EVADC_G_Q_QCTRL_GTLVL_OFF (20u)

/** \brief Length for Ifx_EVADC_G_Q_QCTRL_Bits.GTWC */
#define IFX_EVADC_G_Q_QCTRL_GTWC_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QCTRL_Bits.GTWC */
#define IFX_EVADC_G_Q_QCTRL_GTWC_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QCTRL_Bits.GTWC */
#define IFX_EVADC_G_Q_QCTRL_GTWC_OFF (23u)

/** \brief Length for Ifx_EVADC_G_Q_QCTRL_Bits.TMEN */
#define IFX_EVADC_G_Q_QCTRL_TMEN_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QCTRL_Bits.TMEN */
#define IFX_EVADC_G_Q_QCTRL_TMEN_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QCTRL_Bits.TMEN */
#define IFX_EVADC_G_Q_QCTRL_TMEN_OFF (28u)

/** \brief Length for Ifx_EVADC_G_Q_QCTRL_Bits.TMWC */
#define IFX_EVADC_G_Q_QCTRL_TMWC_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QCTRL_Bits.TMWC */
#define IFX_EVADC_G_Q_QCTRL_TMWC_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QCTRL_Bits.TMWC */
#define IFX_EVADC_G_Q_QCTRL_TMWC_OFF (31u)

/** \brief Length for Ifx_EVADC_G_Q_QMR_Bits.ENGT */
#define IFX_EVADC_G_Q_QMR_ENGT_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_Q_QMR_Bits.ENGT */
#define IFX_EVADC_G_Q_QMR_ENGT_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_Q_QMR_Bits.ENGT */
#define IFX_EVADC_G_Q_QMR_ENGT_OFF (0u)

/** \brief Length for Ifx_EVADC_G_Q_QMR_Bits.ENTR */
#define IFX_EVADC_G_Q_QMR_ENTR_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QMR_Bits.ENTR */
#define IFX_EVADC_G_Q_QMR_ENTR_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QMR_Bits.ENTR */
#define IFX_EVADC_G_Q_QMR_ENTR_OFF (2u)

/** \brief Length for Ifx_EVADC_G_Q_QMR_Bits.CLRV */
#define IFX_EVADC_G_Q_QMR_CLRV_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QMR_Bits.CLRV */
#define IFX_EVADC_G_Q_QMR_CLRV_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QMR_Bits.CLRV */
#define IFX_EVADC_G_Q_QMR_CLRV_OFF (8u)

/** \brief Length for Ifx_EVADC_G_Q_QMR_Bits.TREV */
#define IFX_EVADC_G_Q_QMR_TREV_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QMR_Bits.TREV */
#define IFX_EVADC_G_Q_QMR_TREV_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QMR_Bits.TREV */
#define IFX_EVADC_G_Q_QMR_TREV_OFF (9u)

/** \brief Length for Ifx_EVADC_G_Q_QMR_Bits.FLUSH */
#define IFX_EVADC_G_Q_QMR_FLUSH_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QMR_Bits.FLUSH */
#define IFX_EVADC_G_Q_QMR_FLUSH_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QMR_Bits.FLUSH */
#define IFX_EVADC_G_Q_QMR_FLUSH_OFF (10u)

