dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxEvadc_bf.h
/** \brief Offset for Ifx_EVADC_G_REVNP1_Bits.REV11NP */
#define IFX_EVADC_G_REVNP1_REV11NP_OFF (12u)

/** \brief Length for Ifx_EVADC_G_REVNP1_Bits.REV12NP */
#define IFX_EVADC_G_REVNP1_REV12NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_REVNP1_Bits.REV12NP */
#define IFX_EVADC_G_REVNP1_REV12NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_REVNP1_Bits.REV12NP */
#define IFX_EVADC_G_REVNP1_REV12NP_OFF (16u)

/** \brief Length for Ifx_EVADC_G_REVNP1_Bits.REV13NP */
#define IFX_EVADC_G_REVNP1_REV13NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_REVNP1_Bits.REV13NP */
#define IFX_EVADC_G_REVNP1_REV13NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_REVNP1_Bits.REV13NP */
#define IFX_EVADC_G_REVNP1_REV13NP_OFF (20u)

/** \brief Length for Ifx_EVADC_G_REVNP1_Bits.REV14NP */
#define IFX_EVADC_G_REVNP1_REV14NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_REVNP1_Bits.REV14NP */
#define IFX_EVADC_G_REVNP1_REV14NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_REVNP1_Bits.REV14NP */
#define IFX_EVADC_G_REVNP1_REV14NP_OFF (24u)

/** \brief Length for Ifx_EVADC_G_REVNP1_Bits.REV15NP */
#define IFX_EVADC_G_REVNP1_REV15NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_REVNP1_Bits.REV15NP */
#define IFX_EVADC_G_REVNP1_REV15NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_REVNP1_Bits.REV15NP */
#define IFX_EVADC_G_REVNP1_REV15NP_OFF (28u)

/** \brief Length for Ifx_EVADC_G_SEVNP_Bits.SEV0NP */
#define IFX_EVADC_G_SEVNP_SEV0NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_SEVNP_Bits.SEV0NP */
#define IFX_EVADC_G_SEVNP_SEV0NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_SEVNP_Bits.SEV0NP */
#define IFX_EVADC_G_SEVNP_SEV0NP_OFF (0u)

/** \brief Length for Ifx_EVADC_G_SEVNP_Bits.SEV1NP */
#define IFX_EVADC_G_SEVNP_SEV1NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_SEVNP_Bits.SEV1NP */
#define IFX_EVADC_G_SEVNP_SEV1NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_SEVNP_Bits.SEV1NP */
#define IFX_EVADC_G_SEVNP_SEV1NP_OFF (4u)

/** \brief Length for Ifx_EVADC_G_SEVNP_Bits.SEV2NP */
#define IFX_EVADC_G_SEVNP_SEV2NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_SEVNP_Bits.SEV2NP */
#define IFX_EVADC_G_SEVNP_SEV2NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_SEVNP_Bits.SEV2NP */
#define IFX_EVADC_G_SEVNP_SEV2NP_OFF (8u)

/** \brief Length for Ifx_EVADC_G_SRACT_Bits.AGSR0 */
#define IFX_EVADC_G_SRACT_AGSR0_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SRACT_Bits.AGSR0 */
#define IFX_EVADC_G_SRACT_AGSR0_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SRACT_Bits.AGSR0 */
#define IFX_EVADC_G_SRACT_AGSR0_OFF (0u)

/** \brief Length for Ifx_EVADC_G_SRACT_Bits.AGSR1 */
#define IFX_EVADC_G_SRACT_AGSR1_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SRACT_Bits.AGSR1 */
#define IFX_EVADC_G_SRACT_AGSR1_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SRACT_Bits.AGSR1 */
#define IFX_EVADC_G_SRACT_AGSR1_OFF (1u)

/** \brief Length for Ifx_EVADC_G_SRACT_Bits.AGSR2 */
#define IFX_EVADC_G_SRACT_AGSR2_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SRACT_Bits.AGSR2 */
#define IFX_EVADC_G_SRACT_AGSR2_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SRACT_Bits.AGSR2 */
#define IFX_EVADC_G_SRACT_AGSR2_OFF (2u)

/** \brief Length for Ifx_EVADC_G_SRACT_Bits.AGSR3 */
#define IFX_EVADC_G_SRACT_AGSR3_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SRACT_Bits.AGSR3 */
#define IFX_EVADC_G_SRACT_AGSR3_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SRACT_Bits.AGSR3 */
#define IFX_EVADC_G_SRACT_AGSR3_OFF (3u)

/** \brief Length for Ifx_EVADC_G_SRACT_Bits.ASSR0 */
#define IFX_EVADC_G_SRACT_ASSR0_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SRACT_Bits.ASSR0 */
#define IFX_EVADC_G_SRACT_ASSR0_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SRACT_Bits.ASSR0 */
#define IFX_EVADC_G_SRACT_ASSR0_OFF (8u)

/** \brief Length for Ifx_EVADC_G_SRACT_Bits.ASSR1 */
#define IFX_EVADC_G_SRACT_ASSR1_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SRACT_Bits.ASSR1 */
#define IFX_EVADC_G_SRACT_ASSR1_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SRACT_Bits.ASSR1 */
#define IFX_EVADC_G_SRACT_ASSR1_OFF (9u)

/** \brief Length for Ifx_EVADC_G_SRACT_Bits.ASSR2 */
#define IFX_EVADC_G_SRACT_ASSR2_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SRACT_Bits.ASSR2 */
#define IFX_EVADC_G_SRACT_ASSR2_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SRACT_Bits.ASSR2 */
#define IFX_EVADC_G_SRACT_ASSR2_OFF (10u)

/** \brief Length for Ifx_EVADC_G_SRACT_Bits.ASSR3 */
#define IFX_EVADC_G_SRACT_ASSR3_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SRACT_Bits.ASSR3 */
#define IFX_EVADC_G_SRACT_ASSR3_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SRACT_Bits.ASSR3 */
#define IFX_EVADC_G_SRACT_ASSR3_OFF (11u)

/** \brief Length for Ifx_EVADC_G_EMUXCTR_Bits.EMUXSET */
#define IFX_EVADC_G_EMUXCTR_EMUXSET_LEN (3u)

/** \brief Mask for Ifx_EVADC_G_EMUXCTR_Bits.EMUXSET */
#define IFX_EVADC_G_EMUXCTR_EMUXSET_MSK (0x7u)

/** \brief Offset for Ifx_EVADC_G_EMUXCTR_Bits.EMUXSET */
#define IFX_EVADC_G_EMUXCTR_EMUXSET_OFF (0u)

/** \brief Length for Ifx_EVADC_G_EMUXCTR_Bits.EMUXMODE */
#define IFX_EVADC_G_EMUXCTR_EMUXMODE_LEN (3u)

/** \brief Mask for Ifx_EVADC_G_EMUXCTR_Bits.EMUXMODE */
#define IFX_EVADC_G_EMUXCTR_EMUXMODE_MSK (0x7u)

/** \brief Offset for Ifx_EVADC_G_EMUXCTR_Bits.EMUXMODE */
#define IFX_EVADC_G_EMUXCTR_EMUXMODE_OFF (4u)

/** \brief Length for Ifx_EVADC_G_EMUXCTR_Bits.EMXCOD */
#define IFX_EVADC_G_EMUXCTR_EMXCOD_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_EMUXCTR_Bits.EMXCOD */
#define IFX_EVADC_G_EMUXCTR_EMXCOD_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_EMUXCTR_Bits.EMXCOD */
#define IFX_EVADC_G_EMUXCTR_EMXCOD_OFF (12u)

/** \brief Length for Ifx_EVADC_G_EMUXCTR_Bits.EMXST */
#define IFX_EVADC_G_EMUXCTR_EMXST_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_EMUXCTR_Bits.EMXST */
#define IFX_EVADC_G_EMUXCTR_EMXST_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_EMUXCTR_Bits.EMXST */
#define IFX_EVADC_G_EMUXCTR_EMXST_OFF (13u)

/** \brief Length for Ifx_EVADC_G_EMUXCTR_Bits.EMXCSS */
#define IFX_EVADC_G_EMUXCTR_EMXCSS_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_EMUXCTR_Bits.EMXCSS */
#define IFX_EVADC_G_EMUXCTR_EMXCSS_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_EMUXCTR_Bits.EMXCSS */
#define IFX_EVADC_G_EMUXCTR_EMXCSS_OFF (14u)

/** \brief Length for Ifx_EVADC_G_EMUXCTR_Bits.EMXWC */
#define IFX_EVADC_G_EMUXCTR_EMXWC_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_EMUXCTR_Bits.EMXWC */
#define IFX_EVADC_G_EMUXCTR_EMXWC_MSK (0x1u)

